In [1]:
import pandas as pd

In [2]:
# Creating dataframe
india_weather=pd.DataFrame({
    "city": ['Mumbai','Delhi','Bangalore'],
    "temperature": [32,45,30],
    "humdity": [80,60,78]
})

In [3]:
india_weather

        city  temperature  humdity
0     Mumbai           32       80
1      Delhi           45       60
2  Bangalore           30       78

In [4]:
# Creating dataframe
us_weather= pd.DataFrame({
    "city":['new york','chicago','orlando'],
    "temperature": [21,14,35],
    "humdity": [68,65,75]
})

In [5]:
us_weather

       city  temperature  humdity
0  new york           21       68
1   chicago           14       65
2   orlando           35       75

# Concating two dataframes into single file

In [14]:
df=pd.concat([india_weather,us_weather])
df

        city  temperature  humdity
0     Mumbai           32       80
1      Delhi           45       60
2  Bangalore           30       78
0   new york           21       68
1    chicago           14       65
2    orlando           35       75

We can see that index of above dataframe hasn't changed hence rearranging the index

In [16]:
df=pd.concat([india_weather,us_weather], ignore_index=True)
df

        city  temperature  humdity
0     Mumbai           32       80
1      Delhi           45       60
2  Bangalore           30       78
3   new york           21       68
4    chicago           14       65
5    orlando           35       75

# Retrieving information on Key basis

In [17]:
df=pd.concat([india_weather,us_weather], keys=["india","us"])

In [18]:
df

              city  temperature  humdity
india 0     Mumbai           32       80
      1      Delhi           45       60
      2  Bangalore           30       78
us    0   new york           21       68
      1    chicago           14       65
      2    orlando           35       75

In [19]:
df.loc["india"]

        city  temperature  humdity
0     Mumbai           32       80
1      Delhi           45       60
2  Bangalore           30       78

In [20]:
df.loc["us"]

       city  temperature  humdity
0  new york           21       68
1   chicago           14       65
2   orlando           35       75

In [21]:
## Creating another DataFrame
temperature_df=pd.DataFrame({
    "city":["mumbai","delhi","bangalore"],
    "temperature":[32,45,30],
})

In [22]:
temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2  bangalore           30

In [23]:
windspeed_df= pd.DataFrame({
    "city":["delhi","mumbai"],
    "windspeed":[7,12],
})

In [24]:
windspeed_df

     city  windspeed
0   delhi          7
1  mumbai         12

# aligning the index of both Dataframes|

In [25]:
temperature_df=pd.DataFrame({
    "city":["mumbai","delhi","bangalore"],
    "temperature":[32,45,30],
},index=[0,1,2])
temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2  bangalore           30

In [26]:
windspeed_df= pd.DataFrame({
    "city":["delhi","mumbai"],
    "windspeed":[7,12],
},index=[1,0])
windspeed_df

     city  windspeed
1   delhi          7
0  mumbai         12

# concating two dataframes into single file

In [28]:
pd.concat([temperature_df,windspeed_df],axis=1)

        city  temperature    city  windspeed
0     mumbai           32  mumbai       12.0
1      delhi           45   delhi        7.0
2  bangalore           30     NaN        NaN

In [29]:
df1= pd.DataFrame({
    "city":['new york','chicago','orlando'],
    "temperature":[21,14,35],
})
df1

       city  temperature
0  new york           21
1   chicago           14
2   orlando           35

In [30]:
df2= pd.DataFrame({
    "city":['chicago','new york','orlando'],
    "humdity":[65,68,75]})
df2

       city  humdity
0   chicago       65
1  new york       68
2   orlando       75

# Merging two dataframes into single file

In [32]:
df3= pd.merge(df1,df2,on="city")
df3

       city  temperature  humdity
0  new york           21       68
1   chicago           14       65
2   orlando           35       75

# Joins like sql: inner,left,right,outer

In [33]:
df1= pd.DataFrame({
    "city":['new york','chicago','orlando','baltimore'],
    "temperature":[21,14,35,38]
})
df1

        city  temperature
0   new york           21
1    chicago           14
2    orlando           35
3  baltimore           38

In [34]:
df2= pd.DataFrame({
    "city":['chicago','new york','san diego'],
    "humdity":[65,68,71]
})
df2

        city  humdity
0    chicago       65
1   new york       68
2  san diego       71

In [35]:
## Merging two dataframes
pd.merge(df1,df2,on="city")

       city  temperature  humdity
0  new york           21       68
1   chicago           14       65

# Inner join---> only common values between two tables

In [36]:
pd.merge(df1,df2,on="city", how="inner")

       city  temperature  humdity
0  new york           21       68
1   chicago           14       65

# Right join --> get common and all right side table values (i.e.table2)

In [37]:
pd.merge(df1,df2,on="city", how="right")

        city  temperature  humdity
0    chicago         14.0       65
1   new york         21.0       68
2  san diego          NaN       71

# Left join ----> get common and all left side table values(i.e.table 1)

In [38]:
pd.merge(df1,df2, on="city", how="left")

        city  temperature  humdity
0   new york           21     68.0
1    chicago           14     65.0
2    orlando           35      NaN
3  baltimore           38      NaN

# Full outer join ---> get all values (i.e.table1+table2)

In [39]:
pd.merge(df1,df2, on="city", how="outer")

        city  temperature  humdity
0   new york         21.0     68.0
1    chicago         14.0     65.0
2    orlando         35.0      NaN
3  baltimore         38.0      NaN
4  san diego          NaN     71.0